In [1]:
import pandas as pd

Import the sample data.

In [2]:
df = pd.read_csv('example.csv', decimal='.', thousands=',', index_col=0)

Select a set of colums

In [3]:
df[['name', 'revenue']]

                      name   revenue
id
WBX         World of Beans   9000000
PP1              Peter Pan    873000
AOGD  The Adventures of GR  12000000
ML                 My Life    528000
TF              The Flight   1835000
CW                Cold War   3028000

Use loc to select rows by index

In [4]:
df.loc[['WBX', 'CW']]

               name  revenue  unit_price
id
WBX  World of Beans  9000000       49.99
CW         Cold War  3028000       49.99

Slice through the data set with loc

In [5]:
df.loc['PP1':'ML']

                      name   revenue  unit_price
id
PP1              Peter Pan    873000       15.99
AOGD  The Adventures of GR  12000000       17.99
ML                 My Life    528000       39.99

Slice from the second to the end with a step size of 2

In [6]:
df.loc['PP1'::2]

          name  revenue  unit_price
id
PP1  Peter Pan   873000       15.99
ML     My Life   528000       39.99
CW    Cold War  3028000       49.99

Select name and price for just WBX, ML and PP1. In other words: Cross-select both rows and columns.

In [8]:
df.loc[['WBX', 'ML', 'PP1'], ['name', 'unit_price']]

               name  unit_price
id
WBX  World of Beans       49.99
ML          My Life       39.99
PP1       Peter Pan       15.99